app/controllers/feed_controller.rb

  def index
    @feed_posts = FeedPost.all
---
SELECT "feed_posts".* FROM "feed_posts"

  def create
    @feed_post = FeedPost.new(feed_posts_params)

    redirect_to feed_index_path if @feed_post.save
---
INSERT INTO "feed_posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "sdf"], ["body", "sdf"], ["created_at", "2024-10-23 23:16:30.741250"], ["updated_at", "2024-10-23 23:16:30.741250"]]

  def destroy
    @feed_post = FeedPost.find(params[:id])
    @feed_post.destroy
---
SELECT "feed_posts".* FROM "feed_posts" WHERE "feed_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "feed_posts" WHERE "feed_posts"."id" = ?  [["id", 1]]