app/controllers/guest_posts_controller.rb

SELECT "guest_posts".* FROM "guest_posts" ORDER BY "guest_posts"."created_at" DESC
---
  def index
    @guestpost = GuestPost.new
    @guestposts = GuestPost.order(created_at: :desc)

INSERT INTO "guest_posts" ("author", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["author", "teste"], ["title", ""], ["body", ""], ["created_at", "2024-10-24 12:05:07.000446"], ["updated_at", "2024-10-24 12:05:07.000446"]]
---
  def create
    @guestpost = GuestPost.new(guestpost_params)

    redirect_to guestbook_path if @guestpost.save