app/controllers/projects_controller.rb

INSERT INTO "projects" ("link", "title", "body", "stack", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["link", ""], ["title", "zcx"], ["body", ""], ["stack", ""], ["created_at", "2024-10-24 01:57:19.672868"], ["updated_at", "2024-10-24 01:57:19.672868"]]
---
  def create
    @project = Project.new(projects_params)

    redirect_to projects_index_path if @project.save